In [19]:
import pandas as pd
profession = pd.read_csv(r'E:\PythonAnacondaScripts\course-files\Prestige.csv',index_col='name')

In [20]:
profession.head()

                     education  income  women  prestige  census  type
name
gov.administrators       13.11   12351  11.16      68.8    1113  prof
general.managers         12.26   25879   4.02      69.1    1130  prof
accountants              12.77    9271  15.70      63.4    1171  prof
purchasing.officers      11.42    8865   9.11      56.8    1175  prof
chemists                 14.62    8403  11.68      73.5    2111  prof

In [21]:
profession.loc['chemists','type'] = 'scientist'

In [22]:
profession.head()

                     education  income  women  prestige  census       type
name
gov.administrators       13.11   12351  11.16      68.8    1113       prof
general.managers         12.26   25879   4.02      69.1    1130       prof
accountants              12.77    9271  15.70      63.4    1171       prof
purchasing.officers      11.42    8865   9.11      56.8    1175       prof
chemists                 14.62    8403  11.68      73.5    2111  scientist

In [37]:
isScientist = (profession["type"] == 'scientist')

In [38]:
isScientist

name
gov.administrators     False
general.managers       False
accountants            False
purchasing.officers    False
chemists                True
                       ...
bus.drivers            False
taxi.drivers           False
longshoremen           False
typesetters            False
bookbinders            False
Name: type, Length: 102, dtype: bool

In [39]:
profession.loc[isScientist,"prestige"] = 90

In [47]:
profession.loc[(profession['type']== 'scientist'), 'income'] = profession['income'] * 1.5

In [48]:
profession.head()

,education,income,women,prestige,census,type
name,,,,,,
gov.administrators,13.11,12351.000000,11.16,68.8,1113,prof
general.managers,12.26,25879.000000,4.02,69.1,1130,prof
accountants,12.77,9271.000000,15.70,63.4,1171,prof
purchasing.officers,11.42,8865.000000,9.11,56.8,1175,prof
chemists,14.62,95715.421875,11.68,90.0,2111,scientist

In [ ]:
profession.loc[(profession['type']== 'scientist'), 'income'] *= 1.5